// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б

function rectangle(a, b) {return a * 2 + b * 2;}
let a = rectangle(10, 20)
console.log(a)

//--------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу кола з радіусом r

function radius(r) {return Math.PI * Math.pow(r, 2);}
let b = radius(10)
console.log(b)

//--------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r

let cilinder = (h, r) => Math.PI * Math.pow(r, 2) * h;
console.log(cilinder(6, 8))

//--------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив та виводить кожен його елемент

let users = [
    {name: 'vasya', age: 31, status: false},
    {name: 'petya', age: 30, status: true},
    {name: 'kolya', age: 29, status: true},
    {name: 'olya', age: 28, status: false},
    {name: 'max', age: 30, status: true},
    {name: 'anya', age: 31, status: false},
    {name: 'oleg', age: 28, status: false},
    {name: 'andrey', age: 29, status: true},
    {name: 'masha', age: 30, status: true},
    {name: 'olya', age: 31, status: false},
    {name: 'max', age: 31, status: true}
];

function f_arr_1 (arr){
    for (const arrElement of arr) {
        console.log(arrElement)
    }
}
f_arr_1(users)

//--------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент

function paragraf (city){
    document.write(`<p>${city}</p>`)
}
paragraf('Львів')

//--------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

function ul_li_3 (name){
    document.write(`<ul>`)
    document.write(`<li>${name}</li>
                    <li>${name}</li>
                    <li>${name}</li>`)
    document.write(`</ul>`);
}
ul_li_3('Oleg')

//--------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
// Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)

function ul_li_c(text, num) {
    document.write(`<ul>`)
    for (let i = -1; i < num; i++) {
        document.write(`<li>${text}</li>`)
        document.write(`</ul>`);
    }
}
ul_li_c('City Lviv',5)

//--------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список

//--------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13