// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б

function rectangle(a, b) {return a * 2 + b * 2;}
let a = rectangle(10, 20)
console.log(a)

//--------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу кола з радіусом r

function radius(r) {return Math.PI * Math.pow(r, 2);}
let b = radius(10)
console.log(b)

//--------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r

let cilinder = (h, r) => Math.PI * Math.pow(r, 2) * h;
console.log(cilinder(6, 8))

//--------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив та виводить кожен його елемент
// function f_arr_1 (arr){
//     for (const arrElement of arr) {
//         console.log(arrElement)
//     }
// }
// f_arr_1([1,2,3,4,5,6])

//--------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13